#+PROPERTY: header-args :results verbatim :tangle early-init.el :session pgpb :cache no
#+auto_tangle: yes

* early-init.el

  This file is evaluated before the init script.
  
  It sets variables to control initialization.
  
  See: [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html][Emacs docs on early init file.]]


** Warn: auto-generated file

   #+begin_src elisp
     ;;; WARNING: Do NOT edit this file.
     ;; This file is generated from the Org file via =org-tangle= 
     (message "early-init: pgpb")
   #+end_src


   
** GPG encryption key
   :PROPERTIES:
   :ID:       ABDF6552-C523-45A5-8127-5A64DB17DACD
   :END:

   #+begin_src elisp
     (defvar pgpb-gpg-key "pgpb.padilla@gmail.com"
       "GPG key to use for encrypting Org files.")
   #+end_src

**** TODO Allow multiple GPG keys by id
     :PROPERTIES:
     :ID:       135C94D0-CFDE-4F0A-8CBC-94BA1C07D4CF
     :END:

     1. [ ] this is required for my work setup since I have two key
        ids in the Org header config
        

*** Listing GPG keys available in this system

    List (public) keys (=-k=):
     
    #+begin_src bash :session none :tangle no
      gpg -k pgpb.padilla
    #+end_src

    #+RESULTS:
    : pub   ed25519 2021-08-29 [SC] [verfällt: 2025-08-21]
    :       66BF0487843AB5B8F593F64124C50C592A8618EC
    : uid        [ ultimativ ] Pablo Padilla <pgpb.padilla@gmail.com>
    : sub   cv25519 2021-08-29 [E] [verfällt: 2025-08-21]
    : sub   rsa4096 2022-02-16 [E] [verfällt: 2025-08-21]
    : 


    For listing private keys use =-K=.
   

** Set special Org directories
   :PROPERTIES:
   :ID:       B588E4F2-7E78-4204-98F1-E0106538FB21
   :END:

   My Org configuration expects a few special directories to have been
   defined:
   
   #+begin_src elisp
     (defvar pgpb-org-agenda-dir "~/org/31e520d4df"
       "Directory for files that are used to build the Org agenda.")
     (defvar pgpb-org-journal-dir "~/org/0f6de25076"
       "Directory for my Journal files. Not used to build the agenda.")
     (defvar pgpb-org-archive-dir "~/org/2204c36fc7"
       "Directory for Archived files. Not used to build the agenda.")
   #+end_src

   #+RESULTS:
   : pgpb-org-archive-dir


